app/controllers/bids_controller.rb

SELECT * FROM "bids"
---
  def index
    @bids = Bid.all

SELECT * FROM "bids" WHERE ("bids"."id" = 1)
---
  def show
    @bid = Bid.find(params[:id])

SELECT * FROM "bids" WHERE ("bids"."id" = 1)
---
  def edit
    @bid = Bid.find(params[:id])

INSERT INTO "bids" ("name", "desc", "price", "created_at", "updated_at", "user_id") VALUES('Крымск', 'Предложение из крымска', 9871, '2011-02-12 13:55:02', '2011-02-12 13:55:02', 1)
---
  def create
    @bid = Bid.new(params[:bid])
    @bid.user = user

    respond_to do |format|
      if @bid.save

SELECT * FROM "bids" WHERE ("bids"."id" = 4)
UPDATE "bids" SET "name" = 'А как вам это', "desc" = 'Еще одно предложение из крымска(100)', "updated_at" = '2011-02-13 10:35:47' WHERE "id" = 4
---
  def update
    @bid = Bid.find(params[:id])

    respond_to do |format|
      if @bid.update_attributes(params[:bid])