app/controllers/photos_controller.rb

  def index
    @bid = Bid.find(params[:bid_id])
---
SELECT * FROM "bids" WHERE ("bids"."id" = 1)

  def show
    @bid = Bid.find(params[:bid_id])
    @photos = @bid.photos.find(params[:id])
---
SELECT * FROM "bids" WHERE ("bids"."id" = 2)
SELECT * FROM "photos" WHERE ("photos"."id" = 1 AND ("photos".bid_id = 2))

  def new
    @bid = Bid.find(params[:bid_id])
---
SELECT * FROM "bids" WHERE ("bids"."id" = 1)

  def create
    @bid = Bid.find(params[:bid_id])
    @photo = @bid.photos.build(params[:photo])
    if @photo.save
---
SELECT * FROM "bids" WHERE ("bids"."id" = 2)
INSERT INTO "photos" ("desc", "bid_id", "created_at", "updated_at", "photo_file_name", "photo_content_type", "photo_file_size", "photo_updated_at") VALUES('Тестовое фото', 2, '2011-01-25 14:34:33', '2011-01-25 14:34:33', NULL, NULL, NULL, NULL)

  def edit
    @bid = Bid.find(params[:bid_id])
    @photo = @bid.photos.find(params[:id])
---
SELECT * FROM "bids" WHERE ("bids"."id" = 1)
SELECT * FROM "photos" WHERE ("photos"."id" = 9 AND ("photos".bid_id = 1))

  def update
    @bid = Bid.find(params[:bid_id])
    @photo = @bid.photos.find(params[:id])
    if @photo.update_attributes(params[:photo])
---
SELECT * FROM "bids" WHERE ("bids"."id" = 1)
SELECT * FROM "photos" WHERE ("photos"."id" = 10 AND ("photos".bid_id = 1))
UPDATE "photos" SET "desc" = 'Первое фото (e)', "photo_file_name" = 'cash3.png', "photo_content_type" = 'image/png', "photo_file_size" = 774, "photo_updated_at" = '2011-02-02 01:02:42', "updated_at" = '2011-02-02 01:02:42' WHERE "id" = 9

  def destroy
    @bid = Bid.find(params[:bid_id])
    @photo = Photo.find(params[:id])
    @photo.destroy
---
SELECT * FROM "bids" WHERE ("bids"."id" = 1)
SELECT * FROM "photos" WHERE ("photos"."id" = 15 AND ("photos".bid_id = 4))
DELETE FROM "photos" WHERE "id" = 4