app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "crypted_password", "password_salt", "persistence_token", "created_at", "updated_at", "role") VALUES('master', 'master@mail.ru', '60b653a45bb4dd852fb7787a8036ca3e84c332cc8428ef2c4d044c032d7502640b157dd907f1e8470faf751503c7d673f7e03e2731f9ca966c7a477966a2e535', 'vgCYabpY0AgV4uMlK2p', '252c6ad132c8baf0cb1ecae2f1eb03aefaa89c625abe5417c54d509a85a28557ea5cb9dda9fc0adadf45fc62120bab74d9650e88d9d433def42f24ce08ef2f50', '2011-02-09 17:14:47', '2011-02-09 17:14:47', 'native')
---
  def create
    @user = User.new(params[:user])
    if @user.save